<?php
return [

    // *================================================
    // * Backend :
    // *================================================
    'update_admin_password'     => 'تم تحديث كلمة المرور بنجاح',
    'update_admin_details'      => 'تم تحديث البيانات بنجاح',
    'no_matching'               => 'لا يوجد حقول مطابقة',
    'section_added'             => 'تم إضافة القسم بنجاح',
    'section_updated'           => 'تم تحديث القسم بنجاح',
    'category_add'              => 'تم إضافة الفئة بنجاح',
    'category_update'           => 'تم تحديث الفئة بنجاح',
    'category_delete'           => 'تم حذف الفئة بنجاح',
    'banner_add'                => 'تم إضافة الراية بنجاح',
    'banner_update'             => 'تم تحديث الراية بنجاح',
    'banner_delete'             => 'تم حذف الراية بنجاح',
    'product_add'               => 'تم إضافة المنتج بنجاح',
    'product_update'            => 'تم تحديث المنتج بنجاح',
    'product_delete'            => 'تم حذف المنتج بنجاح',
    'product_add'               => 'تم إضافة المنتج بنجاح',
    'product_update'            => 'تم تحديث المنتج بنجاح',
    'product_delete'            => 'تم حذف المنتج بنجاح',
    'browser_error'             => 'هذا المتصفح لا يدعم صيغة الفيدية هذه',
    'sku_already_exists'        => 'قيمة الرمز النوعي موجودة مسبقا !!',
    'size_already_exists'       => 'القياس موجود مسبقا !!',
    'attributes_add'            => 'تم إضافة خصائص المنتج بنجاح !!',
    'attributes_update'         => 'تم تحديث خصائص المنتج بنجاح !!',
    'attributes_delete'         => 'تم حذف خصائص المنتج بنجاح !!',
    'product_attachments_add'       => 'تم اضافة مرفقات المنتج بنجاح !!',
    'product_attachment_delete'     => 'تم حذف المرفق بنجاح !!',
    'product_attachments_delete'    => 'تم حذف مرفقات المنتج بنجاح !!',
    'are_your_sure'             => 'هل أنت متأكد من عملية الحذف ؟',
    'yes_delete'                => 'تعم, احذف !',
    'delete_all_attachs'        => 'هل أنت متأكد من حذف جميع المرفقات ؟',
    'brnad_added'               => 'تم إضافة الشعار بنجاح',
    'brnad_updated'             => 'تم تحديث الشعار بنجاح',





    // *================================================
    // * FrontEnd :
    // *================================================
    'copy_right'                => 'حقوق النشر @2022 متجر الأنوار . جميع الحقوق محفوظة',
    'no_products_yet'           => 'لا يوجد منتجات بعد !!',
    'quant_is_anavailable'      => 'الكمية المطلوبة غير متوفرة',
    'product_added_to_cart'     => 'تم إضافة المنتجات الى الكرت بنجاح !',
    'product_already_exists'    => 'المنتج موجود مسبقاً في الكرت ! ',
    'cant_reduce_quantity'      => 'كمية المنتج يجب ان تكون 1 او اكثر',
    'amount_not_available'      => 'الكمية في المستودع عير متوفرة',
    'cart_product_delete'       => 'تم حذف منتج عربة التسوق بنجاح ! ',
    'registered_success'        => 'تم تسجيلك بنجاح !!',
    'email_already_exists'      => 'هذا الأيميل موجود سابقاً !!',
    'email_or_pass_not_valid'   => 'البريد الإلكتروني أو كلمة المرور غير صالحة',
    'confirm_email'             => 'تأكيد حساب المتجر الألكتروني الخاص بك',
    'please_confirm_email'      => ' من فضلك قم بتأكيد حساب التجارة الإلكترونية الخاص بك',
    'email_confirmed'           => 'تم تأكيد حسابك بنجاح',
    'already_cofirm'            => ' الحساب مفعل مسبقا !',
    'update_user_password'     => 'تم تحديث كلمة المرور بنجاح',
    'update_user_details'      => 'تم تحديث البيانات بنجاح',




    // *================================================
    // * jQuery Validation :
    // *================================================
    'email_not_valid'           => 'يرجى إدخال عنوان بريد إلكتروني صالح',
    'enter_your_name'           => 'من فضلك أدخل إسمك',
    'enter_your_mobile'         => 'من فضلك إدخل هاتفك المحمول',
    'min_mobile'                => 'يجب أن يتكون هاتفك المحمول من 10 أرقام على الأقل',
    'max_mobile'                => 'يجب أن يتكون هاتفك المحمول من 10 أرقام على الأكثر',
    'enter_your_password'       => 'من فضلك أدخل كلمة المرور',
    'current_password'          => 'من فضلك أدخل كلمة المرور الحالية',
    'enter_your_conf__pass'     => 'من فضلك أدخل تأكيد كلمة المرور',
    'min_password'              => 'يجب أن تتكون كلمة المرور الخاصة بك من 8 أحرف على الأقل',
    'max_password'              => 'يجب أن تتكون كلمة المرور الخاصة بك من 25 أحرف على الأكثر',
    'confirm_pass'              => 'يرجى إدخال كلمة المرور مطابقة لكلمة المرور الجديدة',
    'mobile_not_valid'          => 'الرجاء إدخال عنوان هاتف محمول صالح',
    'valid_email'               => 'من فضلك أدخل عنوان بريد ألكتروني صالح',
    'valid_name'                => 'من فضلك أدخل اسم صالح',
    'enter_new_password'        => 'ادخل كلمة المرور الجديدة',




];