<?php
return [

    // *================================================
    // * Backend :
    // *================================================
    'added'                         => 'تم إضافة :name بنجاح',
    'updated'                       => 'تم تحديث :name بنجاح',
    'deleted'                       => 'تم حذف :name بنجاح',
    'is_existed'                    => ':name موجود مسبقاً !!',

    'no_matching'                   => 'لا يوجد حقول مطابقة',
    'browser_error'                 => 'هذا المتصفح لا يدعم صيغة الفيدية هذه',
    'are_your_sure'                 => 'هل أنت متأكد من عملية الحذف ؟',
    'yes_delete'                    => 'تعم, احذف !',
    'delete_all_attachs'            => 'هل أنت متأكد من حذف جميع المرفقات ؟',




    // *================================================
    // * FrontEnd :
    // *================================================
    'copy_right'                    => 'حقوق النشر @2022 متجر An. جميع الحقوق محفوظة',
    'no_products_yet'               => 'لا يوجد منتجات بعد !!',
    'quant_is_anavailable'          => 'الكمية المطلوبة غير متوفرة',
    'product_added_to_cart'         => 'تم إضافة المنتجات الى الكرت بنجاح !',
    'product_already_exists'        => 'المنتج موجود مسبقاً في الكرت ! ',
    'exists_in_wishlist'            => 'المنتج موجود مسبقاً في قائمة الرغبات !',
    'cant_reduce_quantity'          => 'كمية المنتج يجب ان تكون 1 او اكثر',
    'amount_not_available'          => 'الكمية في المستودع عير متوفرة',
    'cart_product_delete'           => 'تم حذف منتج عربة التسوق بنجاح ! ',
    'registered_success'            => 'تم تسجيلك بنجاح !!',
    'email_already_exists'          => 'هذا الأيميل موجود سابقاً !!',
    'email_or_pass_not_valid'       => 'البريد الإلكتروني أو كلمة المرور غير صالحة',
    'confirm_email'                 => 'تأكيد حساب المتجر الألكتروني الخاص بك',
    'please_confirm_email'          => ' من فضلك قم بتأكيد حساب التجارة الإلكترونية الخاص بك',
    'email_confirmed'               => 'تم تأكيد حسابك بنجاح',
    'already_cofirm'                => ' الحساب مفعل مسبقا !',
    'update_user_password'          => 'تم تحديث كلمة المرور بنجاح',
    'update_user_details'           => 'تم تحديث البيانات بنجاح',
    'logged_in_for_coupon'          => 'من فضلك ، قم بتسجيل الدخول لتطبيق القسيمة',
    'coupon_code_not_valid'         => 'رمز القسيمة غير صالح !!',
    'coupon_code_not_active'        => 'رمز القسيمة غير قعال حالياً !!',
    'coupon_code_is_expire'         => 'رمز القسيمة منتهي الصلاحية  !!',
    'cat_not_found_here'            => 'هذه القسيمة ليس لأحد المنتجات المختارة !!',
    'user_not_found_here'           => 'هذه القسيمة ليس لك !!',
    'coupon_apply'                  => 'تم تطبيق رمز القسيمة بنجاح ، أنت تستفيد من الخصم !',
    'delivery_address_add'          => 'تم إضافة عنوان التوصيل بنجاح',
    'delivery_address_update'       => 'تم تحديث عنوان التوصيل بنجاح',
    'delivery_address_delete'       => 'تم حذف عنوان التوصيل بنجاح',
    'order_place_add'               => 'تم وضع الطلب بنجاح',
    'code_already_availated'        => 'لقد استفدت بالفعل من رمز القسيمة هذا !',
    'remove_product_from_cart'      => 'المنتج غير متوفر ، لذلك تم إزالته من سلة التسوق',
    'min_cart_amount'               => 'يجب أن يكون الحد الأدنى لمبلغ سلة التسوق :min دولارات',
    'max_cart_amount'               => 'يجب أن يكون الحد الأعلى لمبلغ سلة التسوق :max دولارات',
    'rating_add'                    => 'تم إضافة التقييم بنجاح',
    'login_to_rate'                 => 'قم بتسجل الدخول لإضافة تقييم لهذا المنتج',
    'login_to_add_wishlist'         => 'قم بتسجل الدخول لأضافة هذا المنتج الى قائمة الرغبات',
    'login_to_display_wishlist'     => 'قم بتسجيل الدخول لعرض قائمة المنتجات الخاصة بك',
    'review_already_exists'         => 'تقييمك موجود بالفعل لهذا المنتج',
    'wishlist_item_delete'          => 'تم حذف المنتج من قائمة الرغبات',
    'order_cancel'                  => 'تم إلغاء الطلب بنجاح',
    'order_return'                  => 'تم إرجاع الطلب بنجاح',
    'order_exchange'                => 'تم تغيير الطلب بنجاح',
    'order_cancel_invalid'          => 'عملية إلغاء طلبك غير صالحة !!',
    'order_return_invalid'          => 'عملية إرجاع طلبك غير صالحة !!',
    'thanks_for_subscription'       => 'شكرا للاشتراك',
    'send_link_to_reset_password'   => 'لقد ارسلنا للتو رابط أعادة تعيين كلمة المرور إلى البريد الالكتروني الخاص بك ',

    // *================================================
    // * jQuery Validation :
    // *================================================
    'email_not_valid'           => 'يرجى إدخال عنوان بريد إلكتروني صالح',
    'enter_your_name'           => 'من فضلك أدخل إسمك',
    'enter_your_mobile'         => 'من فضلك إدخل هاتفك المحمول',
    'min_mobile'                => 'يجب أن يتكون هاتفك المحمول من 10 أرقام على الأقل',
    'max_mobile'                => 'يجب أن يتكون هاتفك المحمول من 10 أرقام على الأكثر',
    'enter_your_password'       => 'من فضلك أدخل كلمة المرور',
    'current_password'          => 'من فضلك أدخل كلمة المرور الحالية',
    'enter_your_conf__pass'     => 'من فضلك أدخل تأكيد كلمة المرور',
    'min_password'              => 'يجب أن تتكون كلمة المرور الخاصة بك من 8 أحرف على الأقل',
    'max_password'              => 'يجب أن تتكون كلمة المرور الخاصة بك من 25 أحرف على الأكثر',
    'confirm_pass'              => 'يرجى إدخال كلمة المرور مطابقة لكلمة المرور الجديدة',
    'mobile_not_valid'          => 'الرجاء إدخال عنوان هاتف محمول صالح',
    'valid_email'               => 'من فضلك أدخل عنوان بريد ألكتروني صالح',
    'valid_name'                => 'من فضلك أدخل اسم صالح',
    'enter_new_password'        => 'ادخل كلمة المرور الجديدة',




];