<?php
return [

    // *================================================
    // * Backend :
    // *================================================
    'added'                         => 'تم إضافة :name بنجاح',
    'placed'                        => 'تم وضع :name بنجاح',
    'updated'                       => 'تم تحديث :name بنجاح',
    'deleted'                       => 'تم حذف :name بنجاح',
    'is_existed'                    => ':name موجود مسبقاً !!',
    'is_expired'                    => ':name منتهي الصلاحية',
    'not_valid'                     => ':name غير صالح ',
    'not_active'                    => ':name غير فعال ',
    'not_available'                 => ':name غير متاح ',
    'login_to'                      => 'من فضلك قم بتسجيل الدخول ل :name',

    'no_matching'                   => 'لا يوجد حقول مطابقة',
    'browser_error'                 => 'هذا المتصفح لا يدعم صيغة الفيدية هذه',
    'are_your_sure'                 => 'هل أنت متأكد من عملية الحذف ؟',
    'yes_delete'                    => 'تعم, احذف !',
    'delete_all_attachs'            => 'هل أنت متأكد من حذف جميع المرفقات ؟',
    'product_attachments_delete'    => 'تم حذف جميع المرفقات',




    // *================================================
    // * FrontEnd :
    // *================================================
    'min_cart_amount'               => 'يجب أن يكون الحد الأدنى لمبلغ سلة التسوق :min دولارات',
    'max_cart_amount'               => 'يجب أن يكون الحد الأعلى لمبلغ سلة التسوق :max دولارات',
    'copy_right'                    => 'حقوق النشر @2022 متجر AN. جميع الحقوق محفوظة',
    'coupon_error_1'                => 'هذه القسيمة ليس لأحد المنتجات المختارة !!',
    'coupon_error_2'                => 'هذه القسيمة ليس لك !!',
    'coupon_error_3'                => 'لقد استفدت بالفعل من رمز القسيمة هذا !',
    'coupon_apply'                  => 'تم تطبيق رمز القسيمة بنجاح ، أنت تستفيد من الخصم !',
    'logged_in_for_coupon'          => 'من فضلك ، قم بتسجيل الدخول لتطبيق القسيمة',
    'order_cancel'                  => 'تم إلغاء الطلب بنجاح',
    'order_return'                  => 'تم إرجاع الطلب بنجاح',
    'order_exchange'                => 'تم تغيير الطلب بنجاح',
    'order_cancel_invalid'          => 'عملية إلغاء طلبك غير صالحة !!',
    'order_return_invalid'          => 'عملية إرجاع طلبك غير صالحة !!',
    'order_return_exchange_invalid' => 'عملية إرجاع أو إلغاء طلبك غير صالحة !!',
    'no_products_yet'               => 'لا يوجد منتجات بعد !!',
    'email_or_password'             => 'الأيميل أو كلمة المرور',
    'cant_reduce_quantity'          => 'كمية المنتج يجب ان تكون 1 او اكثر',
    'registered_success'            => 'تم تسجيلك بنجاح !!',
    'confirm_email'                 => 'تأكيد حساب المتجر الألكتروني الخاص بك',
    'please_confirm_email'          => ' من فضلك قم بتأكيد حساب التجارة الإلكترونية الخاص بك',
    'email_confirmed'               => 'تم تأكيد حسابك بنجاح',
    'already_cofirm'                => ' الحساب مفعل مسبقا !',
    'thanks_for_subscription'       => 'شكرا للاشتراك',
    'send_link_to_reset_password'   => 'لقد ارسلنا للتو رابط أعادة تعيين كلمة المرور إلى البريد الالكتروني الخاص بك ',

    // *================================================
    // * jQuery Validation :
    // *================================================
    'min_mobile'                => 'يجب أن يتكون هاتفك المحمول من 10 أرقام على الأقل',
    'max_mobile'                => 'يجب أن يتكون هاتفك المحمول من 10 أرقام على الأكثر',
    'current_password'          => 'من فضلك أدخل كلمة المرور الحالية',
    'min_password'              => 'يجب أن تتكون كلمة المرور الخاصة بك من 8 أحرف على الأقل',
    'max_password'              => 'يجب أن تتكون كلمة المرور الخاصة بك من 25 أحرف على الأكثر',
    'confirm_pass'              => 'يرجى إدخال كلمة المرور مطابقة لكلمة المرور الجديدة',



    // error pages:
    'error_404_line_1'          => 'Oopps. The page you were looking for doesn\'t exist.',
    'error_404_line_2'          => 'You may have mistyped the address or the page may have moved.',

];